chat_system_1378754138_actor_description=Old Chvakha. Very old swamp witch.
chat_system_1378754138_switch_0_header_1=^?^Oh, the royal searcher comes to old Chvakha again. Have you lost your way in our swamps, or did you actually mean to come to my house?
chat_system_1378754138_snap_0_question=^?^Ha, is old Chvakha having guests again? And not common guests, but marked with all the king's favors. I have not had such guests as you for a long time. How can old Chvakha help a tired traveler? Have you lost your way in the swamp?
chat_system_1378754138_snap_0_answer_0=^?^I came to you on purpose. I was sent to you by your daughter, Martha.
chat_system_1378754138_snap_0_answer_1=^?^I've found the red flowers for the potion.
chat_system_1378754138_snap_0_answer_2=^?^I'd like to buy something from you. Some of those tinctures or ointments that witches usually make.
chat_system_1378754138_snap_0_answer_3=^?^Well, I go from one place to another, help the good people and make bad people better.
chat_system_1378754138_snap_0_answer_4=^?^I'm here about the dwarf...
chat_system_1378754138_snap_0_answer_5=^?^I have some questions for you, kind lady.
chat_system_1378754138_snap_0_header_5=^?^Questions, questions. Everyone has questions, nobody has answers. People go here, ask questions, and then the silverware disappears. Although I've never had it, the silverware I mean, ha-ha. Well, go ahead. Ask what you wanted to ask. Ask, ask. But remember, a lot of knowledge brings a lot of troubles.
chat_system_1378754138_snap_0_answer_6=^?^I found your house by accident, I'm already on my way.
chat_system_1378754138_snap_2_question=^?^Give them to me.<br>[s]The witch snatches the lilies and smells them.[/s]<br>And they are fresh, just as I need. Good job, young lad. I'd take you to be my assistant, but a witch has to have either a girl or a black cat. What if I turn you into a cat? Would you like that?<br>I am kidding, I'm kidding... Wait a little bit, I'll put the lilies into the boiler and in a couple of minutes the potion will be ready.
chat_system_1378754138_snap_2_answer_0=^?^(wait...)
chat_system_1378754138_snap_3_question=^?^[s]The witch indeed returned rather quickly. You even get the impression that she had already made the potion even before she sent you for the lilies.[/s]<br>Here it is, darling. The Rejuvenation Potion. I got the recipe from my great-grandmother. I hope it is not too strong, because I remember how I had to clean the night-pot for my great-grandmother, and change her diapers. She wanted to be young again, but made a little mistake about the proportions.
chat_system_1378754138_snap_3_answer_0=^?^Thank you, granny.
chat_system_1378754138_question_question=^?^Where do such curious lads come from? They ask questions, and poke their nose to the places they shouldn't. You must have heard about the curious knight, whose nose was pinched by his visor, because he poked it into the wrong places. All right, ok, go ahead, ask your questions. I'm feeling kind today, because my new back potion which I made of toadstools turned out to be pretty good, eh?
chat_system_1378754138_question_answer_0=^?^What is such a terrible and disgusting woman doing in such a wise and gentle place as this? I mean, uh, vice versa. Wise woman - terrible place.
chat_system_1378754138_question_header_0=^?^What else can a witch do? She's right at home in the swamp. It is the right place for a real witch. Professional environment, so to speak.
chat_system_1378754138_question_answer_1=^?^I'd like to join the Witches Coven.
chat_system_1378754138_question_answer_2=^?^I need the recipe for a rejuvenation powder. Can you help me?
chat_system_1378754138_question_answer_3=^?^Why does the Witches Coven have a problem with the mages?
chat_system_1378754138_question_header_3=^?^Oh, I'd like to know it myself. It's an old story connected with some research. The mages wanted to know which swamps of Darion had become the cradle of unusual animals, which look uncommon, and eat meat instead of grass and insects, as their relatives do.<br>I was not able to do such work on my own, so I asked my friends to help. For almost a month we roamed about the swamps and mires, looked for unusual animals, and kept records about them: their appearance, character, what they ate and where they lived, these kind of things.<br>I gave Mage Shivarius all my records and the specimens I collected. How happy he was - ah, he even kissed my hands.<br>And one month later he came to me, swearing up and down, killed my pets and destroyed the roof of my house with his lightning. I've never really understood what had happened.<br>
chat_system_1378754138_question_answer_4=^?^What is this Lost Town? Why is there so much fuss about it?
chat_system_1378754138_question_header_4=^?^I know very little about this. Sometimes people say that we witches are assistants to the necromancers, but these Death magicians don't like us any more than they like the other wizards. We don't deal with Death, we deal with ancient forces, very distant from the real Darkness. I only know that this town was hidden by the necromancers from the Crusade. They hid it so well that nobody can find it, even now.
chat_system_1378754138_question_answer_5=^?^I'd like to see if you have anything for sale.
chat_system_1378754138_question_answer_6=^?^Thanks for the hint - I'm already leaving. Good bye.
chat_system_1378754138_snap_1_question=^?^Look at him! He is mocking me! Look at me, youngster! Do I look like someone who knows the secret of the rejuvenation powder? Do I? Probably there is such a powder somewhere, but I've never seen it, and I've never even heard about it - and I've seen and heard a lot in my life.
chat_system_1378754138_snap_1_answer_0=^?^I see. I have some other questions.
chat_system_1378754138_snap_1_header_0=^?^You are a curious lad, aren't you? I've met Searchers before you, but they were mostly interested in ancient treasures and enchanted weapons. All you want is for me to tell you about this and tell you about that. All right, intrude upon my kindness, since you managed to find me in good health and a good mood. If I had a toothache or was feeling grumpy today, then I'd show you.
chat_system_1378754138_snap_1_answer_1=^?^That's is all I wanted to know. Good luck, granny. Be healthy - and be careful! The swamp is a dangerous environment!
chat_system_1378754138_snap_4_question=^?^You? The Coven? Hah, I'm dead. You just killed me with your joke. The searcher cuts without a sword, tramples without a horse. He's invented a new magic! Tells people jokes and they die on the spot. No, not everyone can join the Coven. In addition to talent one needs to have certain special skills and characteristics. For example, do you know any evil spells or crafty designs? Can you cast a jinx on somebody, or do any harm like this?
chat_system_1378754138_snap_4_answer_0=^?^Cast a jinx on somebody? I can do that easily. Even sour cream turns more sour from my look - not to mention milk.
chat_system_1378754138_snap_4_answer_1=^?^I can look at somebody with evil, good, open or squinted eye - provided there is somebody to look at.
chat_system_1378754138_snap_4_answer_2=^?^Harm? Sure, I'm pretty good at that. When I was a child, I was very clumsy, and I harmed and broke a lot of things.
chat_system_1378754138_snap_6_question=^?^Hey! What about your bravery? Aren't you afraid of darkness or spiders? Can you go to a cemetery on a moonless night? What if you need to take a toad or a worm in your hands? I remember when I wanted to join the Coven, I used to squeal and squeal because of frogs.
chat_system_1378754138_snap_6_answer_0=^?^I have enough bravery. I am a knight after all.
chat_system_1378754138_snap_6_answer_1=^?^Toads, spiders... I used to eat them alive on a dare when I was at the Knight's School! I wasn't lucky in playing cards, so I had to do it. Of course, it was not pleasant, but it was quite tolerable.
chat_system_1378754138_snap_6_answer_2=^?^Hmm... Are there a lot of spiders? Are they very hairy and goggle-eyed? I don't mean I'm afraid of them.. I just... Hmm... What am I saying? Of course I'm not afraid; I am a knight after all.
chat_system_1378754138_snap_7_question=^?^Do you know much about herbs and roots? For example, can you distinguish a wolf-root from a climber? Can you make a fly-agaric and break-herb tea?
chat_system_1378754138_snap_7_answer_0=^?^I'll tell you honestly, I don't know a lot about herbs. But I had a room-mate at school, and he made a lot of herbal tea, which could make you chase the imps on the ceiling all night long.
chat_system_1378754138_snap_7_answer_1=^?^Actually I grew up without a mother and father. So I understand something about cooking. I know what should be put in the food to make it good and tasty, and I also know what to use if you want to make it taste bad, and make you feel bad later.
chat_system_1378754138_snap_5_question=^?^Good. What about sacrificing? Are you afraid of blood? Will you be able to kill a harmless and innocent animal for a witch's rite and a dark spell?
chat_system_1378754138_snap_5_answer_0=^?^Oh, you can't imagine how many animals I killed!
chat_system_1378754138_snap_5_answer_1=^?^I couldn't bring myself to kill a harmless, innocent creature. However, according to the principle of the lesser evil - meaning, if many lives are at stake - then it is possible to have an innocent animal killed.
chat_system_1378754138_snap_8_question=^?^And finally, the most important thing, the thing without which even the strongest sorcery and forbidden knowledge will not help you to join the Coven.<br>You must be... A WOMAN! The Coven is only for witches. Only women who do witchcraft and sorcery can join the Coven. And you don't look very much like a witch.
chat_system_1378754138_snap_8_answer_0=^?^Damn it! You've got me, old woman. All right, all right, you've had fun and that's enough. It's my fault; should have put two and two together. You've taught me a lesson.
chat_system_1378754138_snap_8_header_0=^?^Oh, don't be angry with me, I'm just an old fool. I wanted to have a little fun, see you boasting about your talents.
chat_system_1378754138_snap_9_question=^?^A paladin... and he wants to become a witch? To cast curses and spread disease, to boil stinking potions, and collect herbs in the swamps?
chat_system_1378754138_snap_9_answer_0=^?^Hmm. Would I have to do all that? No, our religion prohibits us paladins from doing such things. 
chat_system_1378754138_snap_9_header_0=^?^Now you understand. Look at him, a paladin and he decided to join the Coven. I've been alive for many ages. I mean years - and I have never heard anything like this, ha-ha.
chat_system_1378754138_snap_0_answer_7=^?^Do need any Spider Eggs?
chat_system_1378754138_snap_0_answer_8=^?^About the Spider Eggs...
chat_system_1378754138_snap_16_question=^?^Spider Eggs?! What would I want any of those for?
chat_system_1378754138_snap_16_answer_0=^?^You know, for your, uhm, potions...
chat_system_1378754138_snap_17_question=^?^Potions?! Well, I guess I could use a few. I suppose you're going to want something valuable in return, eh? Well, I got this stash of Magic Crystals that I sto... I mean Shivarius gave me. What would you say to 1 Magic Crystal for every 120 Spider Eggs?
chat_system_1378754138_snap_17_answer_0=^?^Hmmm... well, I guess this sounds okay. Let me go find some eggs...
chat_system_1378754138_snap_17_answer_1=^?^Hmmm... well, I guess this sounds okay. I've got some eggs on me, let's see if we can trade...
chat_system_1378754138_snap_18_question=^?^Yah, what about them?
chat_system_1378754138_snap_18_answer_0=^?^Uhm, nothing...
chat_system_1378754138_snap_18_answer_1=^?^I have some, but I don't have enough.
chat_system_1378754138_snap_18_answer_2=^?^[img_crystal] Receive 1 Magic Crystal for 120 Spider Eggs.
chat_system_1378754138_snap_18_answer_3=^?^[img_crystal] Receive 2 Magic Crystals for 240 Spider Eggs.
chat_system_1378754138_snap_18_answer_4=^?^[img_crystal] Receive 5 Magic Crystals for 600 Spider Eggs.
chat_system_1378754138_snap_18_answer_5=^?^[img_crystal] Receive 10 Magic Crystals for 1200 Spider Eggs.
chat_system_1378754138_snap_18_answer_6=^?^You know, I've changed my mind, show me your shop...
chat_system_1378754138_snap_18_answer_7=^?^You know, I've gotta go...
chat_system_1378754138_snap_19_question=^?^And you call yourself a Royal Snoop! Don't forget, you need at least 120 eggs to trade!
chat_system_1378754138_snap_19_answer_0=^?^Ha, ha - very funny. Let me go find some more...
chat_system_1378754138_snap_20_question=^?^Here take this Magic Crystal. Now what am I going to do with all these eggs? Ah! I've got just the potion...
chat_system_1378754138_snap_20_answer_0=^?^Let's get back to trading...
chat_system_1378754138_snap_20_answer_1=^?^I've gotta go...
chat_system_1378754138_snap_21_question=^?^Here take these Magic Crystals. Now what am I going to do with all these eggs? Ah! Maybe a Shivarius love potion...
chat_system_1378754138_snap_21_answer_0=^?^Let's get back to trading...
chat_system_1378754138_snap_21_answer_1=^?^I've gotta go...
chat_system_1378754138_snap_22_question=^?^You're not very good at royal snooping, are you? Don't forget, you need at least 120 eggs to trade!
chat_system_1378754138_snap_22_answer_0=^?^Ha, ha - loads of laughs. I'll find some or I'm not the Royal Snoo, I mean Treasure Searcher...